{
    "response": {
        "status": "success",
        "totalResults": 204,
        "results": [
            {
                "title": "Price of a US stamp rises to 66 cents, the second hike this year and the 5th increase since 2019",
                "link": "https://www.winnipegfreepress.com/business/2023/07/03/price-of-a-us-stamp-rises-to-66-cents-the-second-hike-this-year-and-the-5th-increase-since-2019",
                "keywords": [
                    "Business",
                    "World"
                ],
                "creator": [
                    "Feedloaderapi"
                ],
                "video_url": null,
                "description": "NEW YORK (AP) — Stamps prices are on the rise, again — one of several changes the U.S. Postal Service is rolling out this month. Starting Sunday, the cost of […]",
                "content": "NEW YORK (AP) — Stamps prices are on the rise, again — one of several changes the U.S. Postal Service is rolling out this month. Read this article for free: Already have an account? To continue reading, please subscribe: + GST from Canada Day to Labour Day* NEW YORK (AP) — Stamps prices are on the rise, again — one of several changes the U.S. Postal Service is rolling out this month. Starting Sunday, the cost of the first-class “forever” stamps will jump from 63 to 66 cents. The latest price comes just months after forever stamps climbed from 60 to 63 cents in January, following a series of similar increases in recent years. When announcing its intention to raise forever stamp prices to 66 cents earlier this year, the USPS cited rising “operating expenses fueled by inflation” and the impacts of “a previously defective pricing model” — noting that changes to mail service costs “are needed to provide the Postal Service with much needed revenue.” Beyond forever stamps, a handful of other mail services will also see price increases starting Sunday. The cost of sending a first-class one-ounce metered letter, for example, will rise to 63 cents and domestic postcards will jump to 51 cents. International postcards and one-ounce letters are both set to move to $1.50. The Postal Service will also launch a new package shipping service, USPS Ground Advantage, on Sunday to replace and combine previous plans. Ground Advantage pricing will reflect a 3.2% decline in retail prices and a 0.7% drop for commercial, the Postal Service says. The Postal Regulatory Commission approved both the price changes and the implementation of Ground Advantage ahead of this month’s changes. The price changes had also been approved by the Governors of the U.S. Postal Service as of the Postal Service’s April notice. Sunday marks the fifth jump in forever stamp prices seen since the start of 2019, when the postage cost 50 cents apiece. When adjusted for inflation, 50 cents in January 2019 equates to about 60 cents in the spring of 2023, according to the Bureau of Labor Statistics’ CPI inflation calculator. For the first quarter of 2023, the Postal Service’s operating revenue was $21.5 billion — an increase of $206 million, even though volume declined by 1.7 billion pieces, or 4.8%, compared with the same period last year. All told, the Postal Service reported a net loss of $1 billion for the first quarter, but that was a $519 million improvement over the $1.5 billion net loss during the same period last year. Advertisement",
                "pubDate": "2023-07-03 17:05:28",
                "image_url": null,
                "source_id": "winnipegfreepress",
                "category": [
                    "world"
                ],
                "country": [
                    "canada"
                ],
                "language": "english"
            }
        ]
    }
}